
#+LATEX_HEADER: \usepackage[table]{xcolor}
#+LaTeX_HEADER: \usepackage{tcolorbox}

#+LaTeX_HEADER: \usepackage{tikz}
#+LaTeX_HEADER: \usepackage[tikz]{bclogo}
#+LaTeX_HEADER: \usepackage[customcolors]{hf-tikz}

#+LaTeX_HEADER: \usepackage{amsmath}
#+LaTeX_HEADER: \usepackage{amsxtra}
#+LATEX_HEADER: \usepackage{mathtools} 
#+Latex: \everymath{\displaystyle}
#+Latex: \renewcommand{\arraystretch}{1.2}

#+SETUPFILE: ~/.emacs.d/git-submodules/org-html-themes/org/theme-readtheorg.setup

**** Leaky Integrator in C


#+ATTR_LATEX: :options bgcolor=gray!10
#+Name: leaky 
#+BEGIN_SRC C++ :exports source :flags -std=c++11 :includes '(<stdio.h> <algorithm> <functional> <iostream>)
  using namespace std;
  
  double leaky(double x) {
      static const double lambda = 0.9;
      static double y = 0;   // 1x memory cell
      // plus initialization
      // algorithm: 2x multiplication, 1x addition 
      y = lambda * y + (1-lambda) *x;
      return y;
  }
  
  int main() {
      int n;
      for(n = 0; n <20; n++)
      {
          //call with delta signl
          printf("%.4f ", leaky(n==0 ? 1.0 : 0.0));  
          //if(!((n+1)%10)) printf("\n");
      }
  }
  #+END_SRC

  #+results: leaky
  : 0.1000 0.0900 0.0810 0.0729 0.0656 0.0590 0.0531 0.0478 0.0430 0.0387 0.0349 0.0314 0.0282 0.0254 0.0229 0.0206 0.0185 0.0167 0.0150 0.0135

  - we need a "memory cell" to store previous state
- we need to initialize the storage before first use
- we need 2 multiplications and one addition per output sampel
  
